document.addEventListener('DOMContentLoaded', () => {
    const text = `مرحبًا بكم في صفحتي الرسمية، أنا مستر محمد العاصي، فخور إني خبير تعليمي متخصص في مواد الدراسات الاجتماعية للإعدادي، والجغرافيا والتاريخ للثانوي، وكمان الجيولوجيا. بخبرة تمتد على مدار سنوات في التدريس، قدرت أحقق فهم عميق للمناهج وتقديمها بأسلوب سهل وممتع للطلاب.خلال مسيرتي، دايمًا كنت أؤمن إن التعليم مش مجرّد نقل معلومات، لكنه رحلة لاستكشاف العالم من حولنا. بحب أستخدم أمثلة حقيقية من الواقع اللي بنعيشه عشان أقرب المفاهيم الصعبة وأحوّلها لمعلومات ملموسة وسهلة الفهم. مثلًا في درس الجغرافيا، لما باتكلم عن التضاريس والجبال، باجيب صور وأمثلة من بلادنا الجميلة عشان أشوف الحماس في عيون طلابي وهم بيتعلموا عن أماكن يمكن يزوروها في يوم من الأيام.موضوعات التاريخ بنقربها من الحاضر عشان نساعد الطلاب في فهم تأثيرها على حياتنا اليومية، زي مثال التاريخ الاقتصادي والسياسي لمصر وتأثيره على تطور المجتمع الحالي. أما الجيولوجيا، فهي حب من نوع خاص، لأنها بتشرح قصة كوكبنا، ومن هنا باديشجع طلابي يستكشفوا ويجروا تجارب علمية بأيديهم عشان يفهموا طبقات الأرض وتاريخها.أسلوبي في التدريس دايمًا بيكون تفاعلي ومبني على الحوار. بحب أسمع من الطلاب وأفتح لهم مساحات للنقاش والتفكير النقدي. وبحب أستخدم التقنيات الحديثة لخلق بيئة تعليمية مبتكرة تشجع على التعلم الذاتي.يسعدني إني أكون جزء من رحلة تعليمية ناجحة تساعد طلابي يحققوا أهدافهم ويتفوقوا في حياتهم الأكاديمية والمهنية. شاكر لكل طالب مر عليّ وساهم في تطويري أنا شخصيًا كمدرس وكإنسان.لو عندكم أي استفسارات أو حابين تنضموا لبرامجنا التعليمية، بلاش تترددوا في التواصل معايا من خلال صفحتي أو الموقع الرسمي. حكون سعيد بالإجابة على أي تساؤل!`;

    const paragraphElement = document.querySelector('.typewriter');
    const lines = text.split("\n");
    let lineIndex = 0;
    let charIndex = 0;

    function typeText() {
        if (lineIndex < lines.length) {
            let currentLine = lines[lineIndex];
            if (charIndex < currentLine.length) {
                paragraphElement.innerHTML += currentLine[charIndex];
                charIndex++;
                setTimeout(typeText, 50);
            } else {
                lineIndex++;
                charIndex = 0;
                paragraphElement.innerHTML += "<br>";
                setTimeout(typeText, 200);
            }
        }
    }

    typeText();
});
